In [ ]:
import numpy as np
import pandas as pd

In [4]:
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [3]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url formatted like in the examples in this lesson.

In [7]:
def get_db_url(username,password,hostname,database_name):
    url = f'mysql+pymysql://{username}:{password}@{hostname}/{database_name}'
    return pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

In [8]:
get_db_url("darden_1042","3bPpXOzfuGSGd4NGAo8IJQ0596anwXRB","157.230.209.171","employees")

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [9]:
from pydataset import data

In [10]:
mpg = data('mpg')

In [11]:
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [12]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

On average, which manufacturer has the best miles per gallon?

In [13]:
mpg['average_mileage'] = (mpg.cty + mpg.hwy) / 2

In [14]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,21.5

In [16]:
highest = mpg.average_mileage.max()

In [120]:
mpg[mpg['average_mileage'] == highest]

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,average_mileage
222,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,39.5

In [122]:
mpg.sort_values(by="average_mileage", ascending=False).head(1)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,average_mileage
222,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,39.5

How many different manufacturers are there?

In [21]:
len(mpg['manufacturer'].unique())

15

How many different models are there?

In [22]:
len(mpg['model'].unique())

38

Do automatic or manual cars have better miles per gallon?

In [23]:
auto = mpg[mpg.trans.str.contains('auto', regex=False)]

In [26]:
sum(auto.average_mileage) / len(auto)

19.130573248407643

In [27]:
manual = mpg[mpg.trans.str.contains('manual', regex=False)]

In [28]:
sum(manual.average_mileage) / len(manual)

22.227272727272727

Copy the users and roles dataframes from the examples above. 
What do you think a right join would look like? An outer join? 
What happens if you drop the foreign keys from the dataframes and 
try to merge them?

In [29]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [30]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [31]:
pd.merge(users, roles, left_on='role_id', right_on='id', how='right')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [32]:
pd.merge(users, roles, left_on='role_id', right_on='id', how='outer')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [39]:
users = users.drop(columns=['role_id'])

In [40]:
users

   id   name
0   1    bob
1   2    joe
2   3  sally
3   4   adam
4   5   jane
5   6   mike

In [41]:
pd.merge(users, roles, left_on='role_id', right_on='id', how='outer')

KeyError: 'role_id'

It throws an error because there is no common key to link them

In [43]:
get_db_url("darden_1042","3bPpXOzfuGSGd4NGAo8IJQ0596anwXRB","157.230.209.171","employees")

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

Read the employees and titles tables into two separate dataframes

In [46]:
employees = pd.read_sql_table('employees', url)

In [45]:
employees

        emp_no birth_date first_name last_name gender  hire_date
0        10001 1953-09-02     Georgi   Facello      M 1986-06-26
1        10002 1964-06-02    Bezalel    Simmel      F 1985-11-21
2        10003 1959-12-03      Parto   Bamford      M 1986-08-28
3        10004 1954-05-01  Chirstian   Koblick      M 1986-12-01
4        10005 1955-01-21    Kyoichi  Maliniak      M 1989-09-12
...        ...        ...        ...       ...    ...        ...
300019  499995 1958-09-24     Dekang  Lichtner      F 1993-01-12
300020  499996 1953-03-07       Zito      Baaz      M 1990-09-27
300021  499997 1961-08-03    Berhard    Lenart      M 1986-04-21
300022  499998 1956-09-05   Patricia   Breugel      M 1993-10-13
300023  499999 1958-05-01     Sachin   Tsukuda      M 1997-11-30

[300024 rows x 6 columns]

In [47]:
titles = pd.read_sql_table('titles', url)

In [48]:
titles

        emp_no            title  from_date    to_date
0        10001  Senior Engineer 1986-06-26        NaT
1        10002            Staff 1996-08-03        NaT
2        10003  Senior Engineer 1995-12-03        NaT
3        10004         Engineer 1986-12-01 1995-12-01
4        10004  Senior Engineer 1995-12-01        NaT
...        ...              ...        ...        ...
443303  499997         Engineer 1987-08-30 1992-08-29
443304  499997  Senior Engineer 1992-08-29        NaT
443305  499998     Senior Staff 1998-12-27        NaT
443306  499998            Staff 1993-12-27 1998-12-27
443307  499999         Engineer 1997-11-30        NaT

[443308 rows x 4 columns]

Visualize the number of employees with each title.

In [124]:
titles.groupby('title').size()

title
Assistant Engineer     15128
Engineer              115003
Manager                   24
Senior Engineer        97750
Senior Staff           92853
Staff                 107391
Technique Leader       15159
dtype: int64

Join the employees and titles dataframes together.

In [61]:
pd.merge(employees, titles, left_on='emp_no', right_on='emp_no', how='left')

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,NaT
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,NaT
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,NaT
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,NaT
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,NaT
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,NaT
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,NaT

Visualize how frequently employees change titles.

In [140]:
titles.title.count() / len(titles.emp_no.unique())

1.4775751273231474

For each title, find the hire date of the employee that was hired most recently with that title.

In [144]:
titles.groupby('title').from_date.max()

title
Assistant Engineer   2000-02-01
Engineer             2002-08-01
Manager              1996-08-30
Senior Engineer      2002-08-01
Senior Staff         2002-08-01
Staff                2000-02-01
Technique Leader     2000-02-01
Name: from_date, dtype: datetime64[ns]

Write the code necessary to create a cross tabulation of the
number of titles by department.
(Hint: this will involve a combination of SQL and python/pandas code)

In [145]:
dept_emp = pd.read_sql_table('dept_emp', url)

In [147]:
df = pd.merge(dept_emp, titles, left_on='emp_no', right_on='emp_no', how='inner')

In [148]:
df

,emp_no,dept_no,from_date_x,to_date_x,title,from_date_y,to_date_y
0,10001,d005,1986-06-26,NaT,Senior Engineer,1986-06-26,NaT
1,10002,d007,1996-08-03,NaT,Staff,1996-08-03,NaT
2,10003,d004,1995-12-03,NaT,Senior Engineer,1995-12-03,NaT
3,10004,d004,1986-12-01,NaT,Engineer,1986-12-01,1995-12-01
4,10004,d004,1986-12-01,NaT,Senior Engineer,1995-12-01,NaT
...,...,...,...,...,...,...,...
489898,499997,d005,1987-08-30,NaT,Engineer,1987-08-30,1992-08-29
489899,499997,d005,1987-08-30,NaT,Senior Engineer,1992-08-29,NaT
489900,499998,d002,1993-12-27,NaT,Senior Staff,1998-12-27,NaT
489901,499998,d002,1993-12-27,NaT,Staff,1993-12-27,1998-12-27
489902,499999,d004,1997-11-30,NaT,Engineer,1997-11-30,NaT

In [150]:
pd.crosstab(df.title, df.dept_no)

dept_no,d001,d002,d003,d004,d005,d006,d007,d008,d009
title,,,,,,,,,
Assistant Engineer,0,0,0,6445,7769,1831,0,378,298
Engineer,0,0,0,49649,58135,13852,0,2986,2362
Manager,2,2,2,4,2,4,2,2,4
Senior Engineer,0,0,0,42205,49326,11864,0,2570,2027
Senior Staff,13940,12139,12274,1270,1247,0,36191,11637,13925
Staff,16196,13929,14342,1478,1424,0,41808,13495,16150
Technique Leader,0,0,0,6557,7683,1795,0,393,309